#①三大技术 ：HTML  CSS  Java
# HTML       ：                                                  定义网页结构和信息【python 最关心】
#                                                                编写html 用VScode = visual studio code
#            <!DOCTYPE HTML>                                     告知浏览器文件类型==html  + 内容  +  /html
#            <html>                                              起始标签
#                 <body>                                         body表示文档的主体
#                      <h1>这是一个标题</h1>                       h1表示一级标题
#                      <p>这是一段文字这是一段文字这是一段文字</p>      p表示文本段落  h1和p是兄弟元素
#                 </body>
#            </html>                                             闭合标签

# CSS        ：网页的样式，不然就是纯白文字网页
# javaScripe ：定义了用户和网页的互交逻辑

#②浏览器点击右键 →显示网页源代码  →
# 或者点击检查→  左侧小箭头 查看对于图文的代码

#③学习 正则表达式库:re   解析时可以更加精简代码
#④学习 多线程  不同线程爬取多个页面 增加效率
#⑤学习 数据库  可以把数据存储起来
#⑥学习 数据分析 从数据中获得更多学习


